Revit 2027 API
DockablePanes Class
Provides a container of all Revit built-in DockablePaneId instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePanes
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DockablePanes
Public NotInheritable Class DockablePanes
public ref class DockablePanes abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DockablePanes = class end
See Also
Reference
Autodesk.Revit.UI Namespace